SUBJECTS = [
    "Русский🇷🇺",
    "Литература📚",
    "Алгебра🔢",
    "Геометрия📐",
    "Биология🌿",
    "География🌐",
    "История🗿",
    "Право⚖️",
    "Химия🧪",
    "Физкультура⚽️",
    "English🇬🇧",
    "Физика⚡️",
    "Информатика📡",
]

URL_USER = f'http://127.0.0.1:5000/api/user'
URL_CLASS = f'http://127.0.0.1:5000/api/class'
URL_SCHEDULE = 'http://127.0.0.1:5000/api/schedule'
URL_HOMEWORK = 'http://127.0.0.1:5000/api/homework'
URL_TIME_TABLE = 'http://127.0.0.1:5000/api/time_table'
URL_CURRENT_LESSONS = 'http://127.0.0.1:5000/api/current_lessons'
WEEKDAYS = {0: 'понедельник', 1: 'вторник', 2: 'среда', 3: 'четверг', 4: 'пятница',
            5: 'суббота', 6: 'воскресенье'}
